[
  {
    "action_id": "action_4",
    "title": "Enforce FK constraint between email_events.send_id and email_sends.send_id",
    "description": "Implement and roll out a foreign key (FK) constraint to enforce referential integrity between email_events.send_id and email_sends.send_id in the e_commerce email engagement schema. Steps: (1) Profile current data to quantify orphan email_events (events with send_id not present in email_sends). (2) Align on expected behavior for invalid send_id values (e.g., reject inserts, log to a quarantine table, or backfill from source ESP logs). (3) Add appropriate indexes on email_events.send_id and email_sends.send_id to avoid performance regressions. (4) Introduce the FK constraint in a non-blocking way (e.g., create NOT VALID constraint, backfill/fix data, then VALIDATE CONSTRAINT in production). (5) Update ETL/ELT pipelines to fail fast or route bad records when FK violations occur. This ensures every tracked email event (open, click, bounce, etc.) is tied to a valid email send record, improving attribution accuracy and downstream reporting.",
    "action_type": "implementation",
    "priority": "high",
    "priority_score": 3.4,
    "impact": "high",
    "effort": "medium",
    "estimated_hours": 16,
    "source_decision": "decision_link_email_events_email_sends",
    "dependencies": [],
    "assignee_role": "developer",
    "status": "pending"
  },
  {
    "action_id": "action_3",
    "title": "Implement data quality checks for send_id linkage across email_sends and conversions",
    "description": "Design and implement automated data quality checks to ensure the integrity of send_id linkage between conversions and email_sends in the e_commerce funnel. Scope: conversions table (e.g., orders, purchases, sign-ups) and email_sends. Checks should include: (1) Daily completeness check: percentage of conversion records with a non-null send_id where email_sends.send_id exists (target threshold defined by attribution model). (2) Orphan detection: count and rate of conversions with send_id not found in email_sends. (3) Consistency checks: ensure send_id type, format, and cardinality match expectations (e.g., one send_id can map to many conversions, but each conversion has at most one send_id). (4) Trend monitoring: track these metrics over time and alert on deviations beyond configured thresholds. Implement checks in the existing data quality framework (e.g., dbt tests, Great Expectations, or custom SQL jobs) and integrate with monitoring/alerting (e.g., Slack, email, dashboards).",
    "action_type": "implementation",
    "priority": "medium",
    "priority_score": 3.1,
    "impact": "high",
    "effort": "high",
    "estimated_hours": 32,
    "source_decision": "decision_link_conversions_email_sends",
    "dependencies": [
      "action_2"
    ],
    "assignee_role": "developer",
    "status": "pending"
  },
  {
    "action_id": "action_2",
    "title": "Document email-to-conversion attribution model and data quality thresholds",
    "description": "Create clear documentation for the email-to-conversion attribution model used in the e_commerce domain and define the expected data quality thresholds that support it. Content should cover: (1) Attribution logic (e.g., last-click email, multi-touch, or first-touch) and how send_id is propagated from email_sends to conversions. (2) Business rules for associating conversions with sends (e.g., attribution window in days, handling multiple sends per user, priority rules when multiple campaigns are involved). (3) Required data fields and their definitions (send_id, customer_id, event timestamps, conversion types). (4) Target data quality thresholds (e.g., minimum % of conversions with valid send_id, maximum allowed orphan rate, acceptable lag between send and conversion). (5) Examples and edge cases (e.g., unsubscribes, bounced emails, anonymous conversions). Store this documentation in the central knowledge base or data catalog and link it to the relevant tables and dashboards.",
    "action_type": "documentation",
    "priority": "medium",
    "priority_score": 2.9,
    "impact": "low",
    "effort": "low",
    "estimated_hours": 8,
    "source_decision": "decision_link_conversions_email_sends",
    "dependencies": [],
    "assignee_role": "analyst",
    "status": "pending"
  },
  {
    "action_id": "action_5",
    "title": "Create data dictionary for email event types and their relationship to sends",
    "description": "Develop data dictionary entries for the email_events and email_sends tables to clarify event semantics and their linkage via send_id. The documentation should: (1) Enumerate all event types (e.g., delivered, open, click, bounce, spam_report, unsubscribe) with precise business definitions and source system mappings. (2) Describe how each event type relates to an email send (e.g., one send can have multiple open and click events, but only one delivered event). (3) Specify field-level definitions for key columns (send_id, event_type, event_timestamp, user/customer identifiers, campaign identifiers). (4) Clarify any known quirks or limitations (e.g., missing events from certain ESPs, delayed events, deduplication rules). (5) Link these dictionary entries to the FK relationship between email_events.send_id and email_sends.send_id so consumers understand the integrity guarantees once constraints are enforced. Publish in the central data catalog or documentation portal.",
    "action_type": "documentation",
    "priority": "medium",
    "priority_score": 2.9,
    "impact": "low",
    "effort": "low",
    "estimated_hours": 8,
    "source_decision": "decision_link_email_events_email_sends",
    "dependencies": [],
    "assignee_role": "analyst",
    "status": "pending"
  },
  {
    "action_id": "action_1",
    "title": "Set up automated tracking of conversion rates per email send",
    "description": "Implement automated tracking and reporting to measure conversion rates per email send and continuously validate the strength of the email_sends → conversions relationship. Steps: (1) Define core KPIs: conversion rate per send_id, revenue per send_id, and conversion lag distributions. (2) Build a scheduled aggregation job (e.g., daily) that joins email_sends to conversions on send_id and computes these metrics by campaign, template, and segment. (3) Create a monitoring dashboard that highlights anomalies such as sudden drops in attributed conversions, spikes in un-attributed conversions, or unexpected changes in conversion lag. (4) Configure alerts when metrics fall outside defined thresholds (from the attribution documentation) to catch data pipeline or tracking issues early. (5) Ensure the tracking logic is versioned and documented so that changes to attribution rules are traceable over time.",
    "action_type": "monitoring",
    "priority": "medium",
    "priority_score": 2.6,
    "impact": "low",
    "effort": "medium",
    "estimated_hours": 24,
    "source_decision": "decision_link_conversions_email_sends",
    "dependencies": [
      "action_2",
      "action_3"
    ],
    "assignee_role": "analyst",
    "status": "pending"
  },
  {
    "action_id": "action_6",
    "title": "Implement orphan email event detection for email_events without matching sends",
    "description": "Create a monitoring and alerting mechanism to detect and track orphan email_events records (events whose send_id does not exist in email_sends). Scope: (1) Implement a recurring job that joins email_events to email_sends on send_id and computes the orphan rate (events with missing parent send). (2) Break down orphan events by event_type, source system, and ingestion pipeline to localize issues. (3) Define acceptable thresholds for orphan rates and configure alerts when thresholds are exceeded. (4) Optionally write orphan records to a quarantine table for further investigation and remediation. (5) Align this detection with the FK enforcement plan so that orphan detection runs before and after FK constraint rollout, providing visibility into data quality improvements and any regressions.",
    "action_type": "monitoring",
    "priority": "low",
    "priority_score": 2.3,
    "impact": "low",
    "effort": "high",
    "estimated_hours": 32,
    "source_decision": "decision_link_email_events_email_sends",
    "dependencies": [
      "action_4",
      "action_5"
    ],
    "assignee_role": "developer",
    "status": "pending"
  }
]